Revit 2027 API
StructuralSectionConcreteRectangleCut.TopCutWidth Property
 Section width right Cut.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopCutWidth { get; set; }
Public Property TopCutWidth As Double
	Get
	Set
public:
property double TopCutWidth {
	double get ();
	void set (double value);
}
member TopCutWidth : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionConcreteRectangleCut Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace